src/bsl/DataProcessors/гкс_АРМПромежуточныйКомпозит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>гкс_АРМПромежуточныйКомпозит</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСостояний</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Силос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПоказателиУсиленногоКонтроляПоРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Базис</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонятьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛабораторныйАнализ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЛабораторныйАнализ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СоставГруппТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СоставГруппТранспорта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ГруппыТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияТранспорта</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СопоставлениеФНПЛабАнализа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СопоставлениеФНПЛабАнализа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛабораторныйАнализ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЛабораторныйАнализ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсиленныйКонтроль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФормированиеНомераПробы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ФормированиеНомераПробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыПроб</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Композитная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятоПоПревышениюМаксимальногоВеса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтборуПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаРазрешена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Убыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогрузкаРазрешена</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружен</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_СостоянияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияКачества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОбщегоРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПробыНеТребуются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятоВходнойКонтроль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_НазначенияИспользованияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_НазначенияИспользованияКачества</Name>
			<Comment>ERP-2184</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлеваторВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛаборантВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпозитВнешниеПробыНаТысячуТон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточныйКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйАнализ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Documents/гкс_ФормированиеНомераПробы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_ФормированиеНомераПробы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПробы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_НомерПробы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Comment>ERP-1431</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/DataProcessors/гкс_АРМПромежуточныйКомпозит/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьРеквизитыФормы();
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборТочкаМаршрутаПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидПеревозкиПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Подключить = ПроверитьОсновныеОтборы();
	ОбработчикОжидания(Подключить);

КонецПроцедуры

&НаКлиенте
Процедура СуткиПриИзменении(Элемент)
	ОбновитьПериодИФорму();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВсеУсиленныйКонтрольПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВсеПроизвольныйКомпозитПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВсеУсиленныйКонтрольДляТСПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокУсиленныйКонтроль

&НаКлиенте
Процедура СписокСписокУсиленныйКонтрольВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ИмяФормыДокументаНомераПробы = "Документ.гкс_ФормированиеНомераПробы.Форма.ФормаДокумента";
	ИмяФормыДокументаРегистрацияНаПЛК = "Документ.гкс_РегистрацияНаПЛК.Форма.ФормаДокумента";

	Если Поле = Элементы.СписокСписокУсиленныйКонтрольПометка Тогда
		НовоеЗначениеПометки = НЕ ТекущиеДанные.Пометка;
		УстановитьГрупповуюПометкуУсиленныйКонтроль(ТекущиеДанные.ГруппаТС, НовоеЗначениеПометки);

	ИначеЕсли Поле.Имя = "СписокСписокУсиленныйКонтрольНомерПробы" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.ФормированиеПробы) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ФормированиеПробы,
				ИмяФормыДокументаНомераПробы, Истина);
		КонецЕсли;

	ИначеЕсли Поле.Имя = "СписокУсиленныйКонтрольНомерКомпозитнойПробы" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументКомпозитнаяПроба) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ДокументКомпозитнаяПроба,
				ИмяФормыДокументаНомераПробы, Истина);
		КонецЕсли;

	ИначеЕсли Поле.Имя = "СписокУсиленныйКонтрольНомерРегистрации" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрации) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ДокументРегистрации,
				ИмяФормыДокументаРегистрацияНаПЛК, Истина);
		КонецЕсли;

	ИначеЕсли Поле.Имя = "СписокУсиленныйКонтрольГруппаТС" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.ГруппаТС) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ГруппаТС,
				"Справочник.гкс_ГруппыТС.Форма.ФормаЭлемента", Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокУсиленныйКонтрольДляТС
&НаКлиенте
Процедура СписокУсиленныйКонтрольДляТСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ИмяФормыДокументаНомераПробы = "Документ.гкс_ФормированиеНомераПробы.Форма.ФормаДокумента";
	ИмяФормыДокументаРегистрацияНаПЛК = "Документ.гкс_РегистрацияНаПЛК.Форма.ФормаДокумента";

	Если Поле = Элементы.СписокУсиленныйКонтрольДляТСПометка Тогда

		НовоеЗначениеПометки = НЕ ТекущиеДанные.Пометка;

		Для Каждого СтрокаСписка Из СписокУсиленныйКонтрольДляТС Цикл
			СтрокаСписка.Пометка = Ложь;
		КонецЦикла;

		Если НовоеЗначениеПометки Тогда
			Отбор = Новый Структура("ДокументРегистрации", ТекущиеДанные.ДокументРегистрации);
			НайденныеСтроки = СписокУсиленныйКонтрольДляТС.НайтиСтроки(Отбор);
			Для Каждого СтрокаСписка Из НайденныеСтроки Цикл
				СтрокаСписка.Пометка = Истина;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли Поле.Имя = "СписокУсиленныйКонтрольДляТСНомерПробы" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.ФормированиеПробы) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ФормированиеПробы,
				ИмяФормыДокументаНомераПробы, Истина);
		КонецЕсли;

	ИначеЕсли Поле.Имя = "СписокУсиленныйКонтрольДляТСНомерРегистрации" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрации) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ДокументРегистрации,
				ИмяФормыДокументаРегистрацияНаПЛК, Истина);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СписокУсиленныйКонтрольДляТСНомерБлокирующейРегистрации" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.БлокирующаяРегистрация) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.БлокирующаяРегистрация,
				ИмяФормыДокументаРегистрацияНаПЛК, Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПроизвольныйКомпозит

&НаКлиенте
Процедура СписокПроизвольныйКомпозитВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ИмяФормыДокументаНомераПробы = "Документ.гкс_ФормированиеНомераПробы.Форма.ФормаДокумента";
	ИмяФормыДокументаРегистрацияНаПЛК = "Документ.гкс_РегистрацияНаПЛК.Форма.ФормаДокумента";

	Если Поле = Элементы.СписокПроизвольныйКомпозитПометка Тогда

		// Проверка совпадения номенклатуры и контрагента при активации пометки
		Если НЕ ТекущиеДанные.Пометка Тогда
			ПерваяОтмеченнаяСтрока = НайтиПервуюОтмеченнуюСтроку();

			Если ПерваяОтмеченнаяСтрока <> Неопределено Тогда
				МожноПродолжить = ПроверитьСовпадениеДанныхСПервойСтрокой(ТекущиеДанные, ПерваяОтмеченнаяСтрока);
				Если НЕ МожноПродолжить Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		ТекущиеДанные.Пометка = НЕ ТекущиеДанные.Пометка;

	ИначеЕсли Поле.Имя = "СписокПроизвольныйКомпозитНомерПробы" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.ФормированиеПробы) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ФормированиеПробы,
				ИмяФормыДокументаНомераПробы, Истина);
		КонецЕсли;

	ИначеЕсли Поле.Имя = "СписокПроизвольныйКомпозитНомерПромежуточногоКомпозита" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументКомпозитнаяПроба) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ДокументКомпозитнаяПроба,
				ИмяФормыДокументаНомераПробы, Истина);
		КонецЕсли;

	ИначеЕсли Поле.Имя = "СписокПроизвольныйКомпозитНомерРегистрации" Тогда

		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрации) Тогда
			гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ДокументРегистрации,
				ИмяФормыДокументаРегистрацияНаПЛК, Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПромежуточныеПробы

&НаКлиенте
Процедура СписокПромежуточныеПробыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.СписокПромежуточныеПробы.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ДокументОткрытия = Неопределено;
	ИмяФормыДокумента = Неопределено;

	// Определяем документ и форму в зависимости от поля
	Если Поле.Имя = "СписокПромежуточныеПробыЛабораторныйАнализНомер" Тогда
		ДокументОткрытия = ТекущиеДанные.ПромежуточныйКомпозит;
		ИмяФормыДокумента = "Документ.гкс_ЛабораторныйАнализ.Форма.ФормаДокумента";
	ИначеЕсли Поле.Имя = "СписокПромежуточныеПробыНомерПробы" Тогда
		ДокументОткрытия = ТекущиеДанные.ДокументКомпозитнаяПроба;
		ИмяФормыДокумента = "Документ.гкс_ФормированиеНомераПробы.Форма.ФормаДокумента";
	КонецЕсли;

	// Открываем документ, если он заполнен
	Если ЗначениеЗаполнено(ДокументОткрытия) И ЗначениеЗаполнено(ИмяФормыДокумента) Тогда
		гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ДокументОткрытия, ИмяФормыДокумента, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПромежуточныеПробыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.СписокПромежуточныеПробы.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ДокументФормированиеНомераПробы", ТекущиеДанные.ДокументКомпозитнаяПроба);

	СписокРегистрацииПромежуточныхПроб(ПараметрыЗапроса);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРегистрацииПромежуточныхПроб
&НаКлиенте
Процедура СписокРегистрацииПромежуточныхПробВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрации) Тогда
		гкс_ПриемкаНаПЛККлиент.ОткрытьДокумент(ЭтотОбъект, ТекущиеДанные.ДокументРегистрации,
			"Документ.гкс_РегистрацияНаПЛК.Форма.ФормаДокумента", Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаУбавитьСутки(Команда)

	ДобавитьСутки(-1);

КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьСутки(Команда)

	ДобавитьСутки(1);

КонецПроцедуры


&НаКлиенте
Процедура КомандаСформироватьПробыУсиленныйКонтроль(Команда)

	Если НеВсеПромежуточныеКомпозитыЗаДатуСформированы(Сутки - гкс_ОбщегоНазначенияКлиентСервер.СекундВДне()) Тогда
		ТекстСообщения = НСтр("ru = 'Не все промежуточные композитные анализы сформированы за предыдущие сутки!.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

	КомандаСформироватьПробы("УсиленныйКонтроль");

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьУсиленныйКонтроль(Команда)
	ОбновитьПериодИФорму();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПроизвольныйКомпозит(Команда)
	ОбновитьПериодИФорму();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьЭтикетки(Команда)

	ТекущиеДанные = Неопределено;

	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаПроизвольныйКомпозит" Тогда
		ТекущиеДанные = Элементы.СписокПроизвольныйКомпозит.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаПромежуточныеПробы" Тогда
		ТекущиеДанные = Элементы.СписокПромежуточныеПробы.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаУсиленныйКонтроль" Тогда
		ТекущиеДанные = Элементы.СписокУсиленныйКонтроль.ТекущиеДанные;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаУсиленныйКонтрольДляТС" Тогда
		ТекущиеДанные = Элементы.СписокУсиленныйКонтроль.ТекущиеДанные;
	КонецЕсли;

	Если ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Не отмечена проба'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	КомпозитнаяПроба = ТекущиеДанные.ДокументКомпозитнаяПроба;
	Если НЕ ЗначениеЗаполнено(КомпозитнаяПроба) Тогда
		ТекстСообщения = НСтр("ru='Не заполнена композитная проба'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(КомпозитнаяПроба);

	АвтоматическаяПечатьЭтикеток = гкс_ОбщегоНазначенияВызовСервера.ЗначениеКонстанты(
			"гкс_АвтоматическаяПечатьЭтикеток");

	Если АвтоматическаяПечатьЭтикеток Тогда
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("АвтоматическаяПечатьЭтикеток", АвтоматическаяПечатьЭтикеток);

		гкс_УправлениеПечатьюКлиент.ПечатьЭтикеткаНаПринтер(
			"Документ.гкс_ФормированиеНомераПробы", "ПФ_MXL_Этикетка", МассивОбъектов, ПараметрыПечати);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.гкс_ФормированиеНомераПробы",
			"ПФ_MXL_Этикетка", МассивОбъектов, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьПробыПроизвольныйКомпозит(Команда)
	КомандаСформироватьПробы("ПроизвольныйКомпозит");
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьЛабораторныйАнализ(Команда)

	ТекущиеДанные = Элементы.СписокПромежуточныеПробы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяКлючевойОперации = "АРМКомпозитныеПробы.ДокументЛабораторныйАнализ.ОткрытиеФормы";

	Оповещение = Новый ОписаниеОповещения("ОбработчикОжиданияСписок", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;

	Если ЗначениеЗаполнено(ТекущиеДанные.ПромежуточныйКомпозит) Тогда

		ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.ПромежуточныйКомпозит);

		ОткрытьФорму("Документ.гкс_ЛабораторныйАнализ.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект, ЭтотОбъект, , ,
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПромежуточныеПробы(Команда)
	ОбновитьПериодИФорму();
КонецПроцедуры

&НаКлиенте
Процедура АнализыНаКаждоеТС(Команда)

	ВыделенныеСтроки = Элементы.СписокУсиленныйКонтроль.ВыделенныеСтроки;

	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны показатели для обработки'"));
		Возврат;
	КонецЕсли;

	ДанныеДляОбработки = Новый Массив;

	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = СписокУсиленныйКонтроль.НайтиПоИдентификатору(ИдентификаторСтроки);

		Если СтрокаТаблицы <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицы.ГруппаТС) Тогда
			ДанныеСтроки = Новый Структура;
			ДанныеСтроки.Вставить("ГруппаТС", СтрокаТаблицы.ГруппаТС );
			ДанныеСтроки.Вставить("Показатель", СтрокаТаблицы.Показатель);
			ДанныеДляОбработки.Добавить(ДанныеСтроки);
		КонецЕсли;
	КонецЦикла;

	Результат = СформироватьАнализыНаКаждоеТССервер(ДанныеДляОбработки);

	Если Результат.ЕстьДубликаты Тогда
		ПоказатьПредупреждение(, Результат.СообщениеОДубликатах);
	ИначеЕсли Результат.СозданоЗаписей > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Данные заполнены. Могут быть сформированы единичные анализы для ТС.
			|Создано записей: %1'"),
				Результат.СозданоЗаписей));
		ОбновитьПериодИФорму();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Данные не заполнены. Создано записей: %1'"),
				Результат.СозданоЗаписей));
		ОбновитьПериодИФорму();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьУсиленныйКонтрольДляТС(Команда)
	ОбновитьПериодИФорму();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьПробыУсиленныйКонтрольДляТС(Команда)
	КомандаСформироватьПробы("УсиленныйКонтрольДляТС");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает параметры открытия формы и имя формы документа
//
// Параметры:
//  ДокументКомпозитнаяПроба - ДокументСсылка - Существующий документ
//  ОтмеченныеСтроки - Массив - Отмеченные строки
//  ТипСписка - Строка - Тип списка
//
// Возвращаемое значение:
//  Структура - Структура с ключами:
//   * ПараметрыОткрытия - Структура
//   * ИмяФормыДокумента - Строка
//
&НаКлиенте
Функция ПолучитьПараметрыОткрытияФормы(ДокументКомпозитнаяПроба, ОтмеченныеСтроки, ТипСписка)

	Результат = Новый Структура;

	Если ЗначениеЗаполнено(ДокументКомпозитнаяПроба) Тогда
		// Открываем существующий документ
		Результат.Вставить("ПараметрыОткрытия", Новый Структура("Ключ", ДокументКомпозитнаяПроба));
		Результат.Вставить("ИмяФормыДокумента", "Документ.гкс_ФормированиеНомераПробы.Форма.ФормаДокумента");
	Иначе
		// Создаем новый документ
		Результат.Вставить("ПараметрыОткрытия", ПодготовитьПараметрыДляНовогоДокумента(ОтмеченныеСтроки, ТипСписка));
		Результат.Вставить("ИмяФормыДокумента",
			"Обработка.гкс_АРМПромежуточныйКомпозит.Форма.ФормаФормированиеКомпозитнойФормы");
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Выполняет проверки для усиленного контроля
//
// Параметры:
//  НайденныеСтроки - Массив - Массив отмеченных строк
//
// Возвращаемое значение:
//  Булево - Истина, если все проверки пройдены
//
&НаКлиенте
Функция ВыполнитьПроверкиУсиленногоКонтроля(НайденныеСтроки)

	МассивНесовпадений = Новый Массив;

	Результат = ПроверитьСостояниеКачестваУсиленныйКонтроль(НайденныеСтроки, МассивНесовпадений);
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

// Получает список данных в зависимости от типа
//
// Параметры:
//  ТипСписка - Строка - Тип списка
//
// Возвращаемое значение:
//  ТаблицаЗначений - Список данных
//
&НаКлиенте
Функция ПолучитьСписокДанныхПоТипу(ТипСписка)

	Если ТипСписка = "УсиленныйКонтроль" Тогда
		Возврат СписокУсиленныйКонтроль;
	ИначеЕсли ТипСписка = "УсиленныйКонтрольДляТС" Тогда
		Возврат СписокУсиленныйКонтрольДляТС;
	Иначе
		Возврат СписокПроизвольныйКомпозит;
	КонецЕсли;

КонецФункции

// Получает и проверяет отмеченные строки списка
//
// Параметры:
//  СписокДанных - ТаблицаЗначений - Список для анализа
//
// Возвращаемое значение:
//  Массив - Массив отмеченных строк или Неопределено при отсутствии отмеченных строк
//
&НаКлиенте
Функция ПолучитьОтмеченныеСтроки(СписокДанных)

	ОтборПоПометке = Новый Структура("Пометка", Истина);
	НайденныеСтроки = СписокДанных.НайтиСтроки(ОтборПоПометке);

	Если НайденныеСтроки.Количество() = 0 Тогда
		гкс_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не выбрано ни одной строки для формирования проб'"));
		Возврат Неопределено;
	КонецЕсли;

	Возврат НайденныеСтроки;

КонецФункции

// Анализирует отмеченные строки и находит существующий документ композитной пробы
//
// Параметры:
//  НайденныеСтроки - Массив - Массив отмеченных строк
//
// Возвращаемое значение:
//  Структура - Структура с ключами:
//   * ОтмеченныеСтроки - Массив - Строки без существующего документа
//   * ДокументКомпозитнаяПроба - ДокументСсылка, Неопределено - Найденный документ
//
&НаКлиенте
Функция АнализироватьОтмеченныеСтроки(НайденныеСтроки)

	Результат = Новый Структура;
	ОтмеченныеСтроки = Новый Массив;
	ДокументКомпозитнаяПроба = Неопределено;

	Для Каждого СтрокаСписка Из НайденныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаСписка.ДокументКомпозитнаяПроба) Тогда
			ДокументКомпозитнаяПроба = СтрокаСписка.ДокументКомпозитнаяПроба;
			Прервать;
		Иначе
			ОтмеченныеСтроки.Добавить(СтрокаСписка);
		КонецЕсли;
	КонецЦикла;

	Результат.Вставить("ОтмеченныеСтроки", ОтмеченныеСтроки);
	Результат.Вставить("ДокументКомпозитнаяПроба", ДокументКомпозитнаяПроба);

	Возврат Результат;

КонецФункции

// Подготавливает параметры открытия формы для нового документа композитной пробы
//
// Параметры:
//  ОтмеченныеСтроки - Массив - Массив отмеченных строк
//  ТипСписка - Строка - Тип списка ("ПроизвольныйКомпозит" или "УсиленныйКонтроль")
//
// Возвращаемое значение:
//  Структура - Параметры открытия формы
//
&НаКлиенте
Функция ПодготовитьПараметрыДляНовогоДокумента(ОтмеченныеСтроки, ТипСписка)

	ПараметрыОткрытия = Новый Структура;
	ДопПараметры = Новый Структура;

	Если ТипСписка = "УсиленныйКонтрольДляТС" Тогда
		// Для СтраницаУсиленныйКонтрольДляТС вкладки - ЕДИНИЧНЫЕ пробы (одно ТС = один анализ)
		ТипПробы = ПредопределенноеЗначение("Перечисление.гкс_ТипыПроб.Единичная");
	Иначе
		// Для остальных вкладок - композитные пробы
		ТипПробы = ПредопределенноеЗначение("Перечисление.гкс_ТипыПроб.Композитная");
	КонецЕсли;

	// Формируем массив структур из всех отмеченных строк
	МассивСтрокДанных = Новый Массив;
	МассивДокументРегистрации = Новый Массив;
	Для Каждого СтрокаДанных Из ОтмеченныеСтроки Цикл
		Если МассивДокументРегистрации.Найти(СтрокаДанных.ДокументРегистрации) = Неопределено Тогда
			МассивДокументРегистрации.Добавить(СтрокаДанных.ДокументРегистрации);
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("ДокументРегистрации", СтрокаДанных.ДокументРегистрации);
			МассивСтрокДанных.Добавить(СтруктураСтроки);
		КонецЕсли;
	КонецЦикла;


	// Общие параметры
	ДопПараметры.Вставить("Номенклатура", ОтмеченныеСтроки[0].Номенклатура);
	ДопПараметры.Вставить("Контрагент", ОтмеченныеСтроки[0].Контрагент);
	ДопПараметры.Вставить("Организация", ОтмеченныеСтроки[0].Организация);
	ДопПараметры.Вставить("ТочкаМаршрута", Объект.ТочкаМаршрута);
	ДопПараметры.Вставить("ВидПеревозки", Объект.ВидПеревозки);
	ДопПараметры.Вставить("МассивСтрокДанных", МассивСтрокДанных);
	ДопПараметры.Вставить("НачалоПериода", НачалоПериода);
	ДопПараметры.Вставить("КонецПериода", КонецПериода);
	ДопПараметры.Вставить("ПроизводственныеСуткиРегистрации", Сутки);

	ДопПараметры.Вставить("ТипПробы", ТипПробы);

	// Общие для обоих типов - данные о погрузке и станции
	ДопПараметры.Вставить("ПунктПогрузки", ОтмеченныеСтроки[0].ПунктПогрузки);
	ДопПараметры.Вставить("СтанцияОтправления", ОтмеченныеСтроки[0].СтанцияОтправления);
	ДопПараметры.Вставить("СтанцияОтправленияПредставление", ОтмеченныеСтроки[0].СтанцияОтправленияПредставление);

	// Специфичные параметры для усиленного контроля
	Если ТипСписка = "УсиленныйКонтроль" ИЛИ ТипСписка = "УсиленныйКонтрольДляТС" Тогда
		МассивПоказателей = Новый Массив;
		Для Каждого СтрокаДанных Из ОтмеченныеСтроки Цикл
			Если МассивПоказателей.Найти(СтрокаДанных.Показатель) = Неопределено Тогда
				МассивПоказателей.Добавить(СтрокаДанных.Показатель);
			КонецЕсли;
		КонецЦикла;
		ДопПараметры.Вставить("МассивПоказателей", МассивПоказателей);
	КонецЕсли;



	ПараметрыОткрытия.Вставить("ДопПараметры", ДопПараметры);

	// Параметры страницы в зависимости от типа
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;

	Если ТипСписка = "УсиленныйКонтроль" Тогда
		ПараметрыОткрытия.Вставить("СтраницаУсиленныйКонтроль",
			ТекущаяСтраница.Имя = "СтраницаУсиленныйКонтроль");
	ИначеЕсли ТипСписка = "УсиленныйКонтрольДляТС" Тогда
		// СтраницаУсиленныйКонтрольДляТС: единичные пробы для конкретного ТС
		ПараметрыОткрытия.Вставить("СтраницаУсиленныйКонтрольДляТС",
			ТекущаяСтраница.Имя = "СтраницаУсиленныйКонтрольДляТС");
	Иначе
		ПараметрыОткрытия.Вставить("СтраницаПроизвольныйКомпозит",
			ТекущаяСтраница.Имя = "СтраницаПроизвольныйКомпозит");
		ПараметрыОткрытия.Вставить("СтраницаПромежуточныеПробы",
			ТекущаяСтраница.Имя = "СтраницаПромежуточныеПробы");
	КонецЕсли;


	Возврат ПараметрыОткрытия;

КонецФункции

&НаКлиенте
Процедура КомандаСформироватьПробы(ТипСписка = "ПроизвольныйКомпозит")

	// Получаем список данных
	СписокДанных = ПолучитьСписокДанныхПоТипу(ТипСписка);

	// Получаем и проверяем отмеченные строки
	НайденныеСтроки = ПолучитьОтмеченныеСтроки(СписокДанных);
	Если НайденныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Проверки для усиленного контроля (включая УК для ТС)
	Если (ТипСписка = "УсиленныйКонтроль" ИЛИ ТипСписка = "УсиленныйКонтрольДляТС")
		И НЕ ВыполнитьПроверкиУсиленногоКонтроля(НайденныеСтроки) Тогда
		Возврат;
	КонецЕсли;

	// Проверка дублей единичных проб для закладки "УК для ТС"
	Если ТипСписка = "УсиленныйКонтрольДляТС" Тогда
		МассивРегистраций = Новый Массив;
		Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
			МассивРегистраций.Добавить(СтрокаДанных.ДокументРегистрации);
		КонецЦикла;
		Если ЕстьДубликатыЕдиничныхПроб(МассивРегистраций) Тогда
			ПоказатьПредупреждение(,
				НСтр("ru = 'Для выбранных регистраций уже существуют единичные пробы
				|с назначением использования ПромежуточныйКомпозит. Повторное создание невозможно.'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;


	// Анализируем отмеченные строки
	РезультатАнализа = АнализироватьОтмеченныеСтроки(НайденныеСтроки);
	ОтмеченныеСтроки = РезультатАнализа.ОтмеченныеСтроки;
	ДокументКомпозитнаяПроба = РезультатАнализа.ДокументКомпозитнаяПроба;

	// Подготовка параметров открытия формы
	ПараметрыФормы = ПолучитьПараметрыОткрытияФормы(ДокументКомпозитнаяПроба, ОтмеченныеСтроки, ТипСписка);
	Оповещение = Новый ОписаниеОповещения("ОбработчикОжиданияСписок", ЭтотОбъект);

	ОткрытьФорму(ПараметрыФормы.ИмяФормыДокумента, ПараметрыФормы.ПараметрыОткрытия, ЭтотОбъект, ЭтотОбъект, , ,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция НайтиПервуюОтмеченнуюСтроку()

	Для Каждого СтрокаСписка Из СписокПроизвольныйКомпозит Цикл
		Если СтрокаСписка.Пометка Тогда
			Возврат СтрокаСписка;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

&НаКлиенте
Функция ПроверитьСовпадениеДанныхСПервойСтрокой(ТекущиеДанные, ПерваяОтмеченнаяСтрока)

	МассивНесовпадений = Новый Массив;

	// Проверяем номенклатуру
	Если ТекущиеДанные.Номенклатура <> ПерваяОтмеченнаяСтрока.Номенклатура Тогда
		// Формируем текст сообщения по аналогии с контрагентом
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Выбранная строка имеет отличающиеся данные от первой отмеченной строки:%1- Номенклатура'"),
			Символы.ПС);
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;

	// Проверяем контрагента
	Если ТекущиеДанные.Контрагент <> ПерваяОтмеченнаяСтрока.Контрагент Тогда
		МассивНесовпадений.Добавить("Контрагент");
	КонецЕсли;

	Если ТекущиеДанные.Организация <> ПерваяОтмеченнаяСтрока.Организация Тогда
		МассивНесовпадений.Добавить("Организация");
	КонецЕсли;

	// Выводим сообщение при наличии несовпадений
	Если МассивНесовпадений.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Выбранная строка имеет отличающиеся данные от первой отмеченной строки:'");

		Для Каждого Несовпадение Из МассивНесовпадений Цикл
			ТекстСообщения = СтрШаблон("%1%2- %3", ТекстСообщения, Символы.ПС, Несовпадение);
		КонецЦикла;

		ТекстСообщения = СтрШаблон("%1%2%3", ТекстСообщения, Символы.ПС, НСтр("ru = 'Продолжить?'"));

		ДополнительныеПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаВопроса", ЭтотОбъект,
			ДополнительныеПараметры);
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, Режим, 0, , "Несовпадение данных");

		Возврат Ложь;

	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ОбработкаРезультатаВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.Пометка = НЕ ТекущиеДанные.Пометка;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПериодИФорму()
	УстановитьПериод();
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()

	Видимость = ПроверитьОсновныеОтборы();

	Элементы.ГруппаСтраницы.Видимость = Видимость;
	Элементы.ГруппаОбщиеОтборы.Видимость = Видимость;

	ОбработчикОжидания(Видимость);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжидания(Подключить)
	Если Подключить Тогда
		ИнтервалОбработки = 0.5;
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСписок", ИнтервалОбработки, Истина);
	Иначе
		ОтключитьОбработчикОжидания("Подключаемый_ОбновитьСписок");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьОсновныеОтборы()
	Возврат ЗначениеЗаполнено(Объект.ТочкаМаршрута)
		И ЗначениеЗаполнено(Объект.ВидПеревозки)
		И ЗначениеЗаполнено(Сутки)
		И ЗначениеЗаполнено(НачалоПериода)
		И ЗначениеЗаполнено(КонецПериода);
КонецФункции

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()

	Сутки = НачалоДня(НачалоДня(ТекущаяДатаСеанса()) - 1);

	СписокСостояний = Объект.СписокСостояний;
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.Прибыл);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.ГотовКОтборуПроб);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.КачествоНеПринято);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.НеПринято);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.ПринятыПробы);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.КачествоПринято);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.ВыгрузкаРазрешена);
	СписокСостояний.Добавить(Перечисления.гкс_СостоянияРегистрации.РезультатыПробПолучены);

	УстановитьПериод();

	ИнициализироватьОтборТочкаМаршрута();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	ИспользоватьУсиленныйКонтроль = ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества");
	Элементы.СтраницаУсиленныйКонтроль.Видимость = ИспользоватьУсиленныйКонтроль;
	Элементы.СтраницаУсиленныйКонтрольДляТС.Видимость = ИспользоватьУсиленныйКонтроль;
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьОтборТочкаМаршрута()

	ИспользоватьНесколькоАЛЦ = ПолучитьФункциональнуюОпцию("гкс_ИспользоватьНесколькоАЛЦ");

	Элементы.ОтборТочкаМаршрута.Доступность = ИспользоватьНесколькоАЛЦ;
	Элементы.ОтборТочкаМаршрута.РежимВыбораИзСписка = ИспользоватьНесколькоАЛЦ;

	АЛЦПользователя = Новый Массив;
	Объект.ТочкаМаршрута =
		гкс_ПриемкаТранспорта.ПЛКизНастроекБазыПользователя(ИспользоватьНесколькоАЛЦ, АЛЦПользователя);
	Если ИспользоватьНесколькоАЛЦ
		И ЗначениеЗаполнено(АЛЦПользователя) Тогда
		СписокВыбора = Элементы.ОтборТочкаМаршрута.СписокВыбора;
		СписокВыбора.ЗагрузитьЗначения(АЛЦПользователя);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСутки(КоличествоСуток)

	Сутки = Сутки + КоличествоСуток * гкс_ОбщегоНазначенияКлиентСервер.СекундВДне();

	ОбновитьПериодИСписки();

КонецПроцедуры

&НаСервере
Процедура УстановитьПериод()

	НачалоПериода = гкс_ПриемкаТранспорта.НачалоПроизводственныхСуток(Сутки);
	КонецПериода = гкс_ПриемкаТранспорта.ОкончаниеПроизводственныхСуток(Сутки);

КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодИСписки()

	// Устанавливаем период
	УстановитьПериод();

	// Заполняем списоки
	ОбновитьСписки();

КонецПроцедуры

#Область ОбработчикиОжидания

&НаКлиенте
Процедура ОбработчикОжиданияСписок(Результат, ДополнительныеПараметры) Экспорт
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСписок()
	ОбновитьСписки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписки()
	ЗаполнитьСписокПроизвольныйКомпозит();
	ЗаполнитьСписокПромежуточныеПробы();
	ЗаполнитьСписокУсиленныйКонтроль();
	ЗаполнитьСписокУсиленныйКонтрольДляТС();
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСписокУсиленныйКонтроль()

	Если НЕ Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаУсиленныйКонтроль" Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗапроса = Новый Структура;

	ПараметрыЗапроса.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыЗапроса.Вставить("КонецПериода", КонецПериода);
	ПараметрыЗапроса.Вставить("ПроизводственныеСуткиРегистрации", Сутки);
	ПараметрыЗапроса.Вставить("ПоказыватьВсе", ПоказыватьВсеУсиленныйКонтроль);

	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеДляСписокУсиленныйКонтроль = Обработка.ДанныеДляСписка(ПараметрыЗапроса, "УсиленныйКонтроль");

	СписокУсиленныйКонтроль.Очистить();
	СписокУсиленныйКонтроль.Загрузить(ДанныеДляСписокУсиленныйКонтроль);
	СписокУсиленныйКонтроль.Сортировать("Контрагент, ГруппаТС");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокУсиленныйКонтрольДляТС()

	Если НЕ Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаУсиленныйКонтрольДляТС" Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыЗапроса.Вставить("КонецПериода", КонецПериода);
	ПараметрыЗапроса.Вставить("ПроизводственныеСуткиРегистрации", Сутки);
	ПараметрыЗапроса.Вставить("ПоказыватьВсе", ПоказыватьВсеУсиленныйКонтрольДляТС);

	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеДляСписокУсиленныйКонтрольДляТС = Обработка.ДанныеДляСписка(ПараметрыЗапроса, "УсиленныйКонтрольДляТС");

	СписокУсиленныйКонтрольДляТС.Очистить();
	СписокУсиленныйКонтрольДляТС.Загрузить(ДанныеДляСписокУсиленныйКонтрольДляТС);
	СписокУсиленныйКонтрольДляТС.Сортировать("НомерРегистрации");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПроизвольныйКомпозит()

	Если НЕ Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаПроизвольныйКомпозит" Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗапроса = Новый Структура;

	ПараметрыЗапроса.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыЗапроса.Вставить("КонецПериода", КонецПериода);
	ПараметрыЗапроса.Вставить("ПроизводственныеСуткиРегистрации", Сутки);
	ПараметрыЗапроса.Вставить("ПоказыватьВсе", ПоказыватьВсеПроизвольныйКомпозит);

	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеДляСписокПроизвольныйКомпозит = Обработка.ДанныеДляСписка(ПараметрыЗапроса, "ПроизвольныйКомпозит");

	СписокПроизвольныйКомпозит.Очистить();
	СписокПроизвольныйКомпозит.Загрузить(ДанныеДляСписокПроизвольныйКомпозит);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПромежуточныеПробы()

	Если НЕ Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаПромежуточныеПробы" Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыЗапроса.Вставить("КонецПериода", КонецПериода);
	ПараметрыЗапроса.Вставить("ПроизводственныеСуткиРегистрации", Сутки);

	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеДляСписокПромежуточныеПробы = Обработка.ДанныеДляСписокПромежуточныеПробы(ПараметрыЗапроса);

	СписокПромежуточныеПробы.Очистить();
	СписокПромежуточныеПробы.Загрузить(ДанныеДляСписокПромежуточныеПробы);

КонецПроцедуры

&НаСервере
Процедура СписокРегистрацииПромежуточныхПроб(ПараметрыЗапроса)


	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеСписокРегистрацииПромежуточныхПроб = Обработка.ДанныеДляСписокРегистрацииПромежуточныхПроб(ПараметрыЗапроса);

	СписокРегистрацииПромежуточныхПроб.Очистить();
	СписокРегистрацииПромежуточныхПроб.Загрузить(ДанныеСписокРегистрацииПромежуточныхПроб);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьГрупповуюПометкуУсиленныйКонтроль(ГруппаТС, НовоеЗначениеПометки)

	Отбор = Новый Структура("ГруппаТС", ГруппаТС);
	НайденныеСтроки = СписокУсиленныйКонтроль.НайтиСтроки(Отбор);

	Для Каждого СтрокаСписка Из НайденныеСтроки Цикл
		СтрокаСписка.Пометка = НовоеЗначениеПометки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьСостояниеКачестваУсиленныйКонтроль(НайденныеСтроки, МассивНесовпадений)

	// Создаем массив допустимых состояний
	ДопустимыеСостояния = Новый СписокЗначений;
	ДопустимыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияКачества.ПустаяСсылка"));
	ДопустимыеСостояния.Добавить(ПредопределенноеЗначение("Перечисление.гкс_СостоянияКачества.ОтборПроб"));

	Для Каждого СтрокаСписка Из НайденныеСтроки Цикл
		// Если состояние НЕ в списке допустимых
		Если ДопустимыеСостояния.НайтиПоЗначению(СтрокаСписка.СостояниеКачества) = Неопределено Тогда

			ШаблонСообщения = НСтр("ru = 'Для регистрации %1 анализы на показатель %2 уже выполнены (состояние: %3).
			|Повторно анализы не могут быть сформированы.'");

			ТекстСообщения = СтрШаблон(ШаблонСообщения,
					СтрокаСписка.ДокументРегистрации,
					СтрокаСписка.Показатель,
					СтрокаСписка.СостояниеКачества);
			гкс_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

// Создать анализы на каждое ТССервер.
//
// Параметры:
//  ДанныеДляОбработки - Массив - Данные для обработки
//
// Возвращаемое значение:
//  Структура - Создать анализы на каждое ТССервер:
// * ЕстьДубликаты - Булево -
// * СообщениеОДубликатах - Строка -
// * СозданоЗаписей - Число -
&НаСервере
Функция СформироватьАнализыНаКаждоеТССервер(ДанныеДляОбработки)

	Результат = Новый Структура("ЕстьДубликаты, СообщениеОДубликатах, СозданоЗаписей", Ложь, "", 0);

	// Формируем таблицу входных данных с типами
	ТаблицаВходныхДанных = Новый ТаблицаЗначений;
	ТаблицаВходныхДанных.Колонки.Добавить("ГруппаТС",
		Новый ОписаниеТипов("СправочникСсылка.гкс_ГруппыТС"));
	ТаблицаВходныхДанных.Колонки.Добавить("Показатель",
		Новый ОписаниеТипов("СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры"));

	Для Каждого Данные Из ДанныеДляОбработки Цикл
		НоваяСтрока = ТаблицаВходныхДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Данные);
	КонецЦикла;

	// Запрос: получение состава групп + проверка дубликатов
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПолучениеСоставаГруппПроверкаДубликатов();
	Запрос.УстановитьПараметр("ТаблицаВходныхДанных", ТаблицаВходныхДанных);
	ТаблицаРезультатов = Запрос.Выполнить().Выгрузить();

	// Проверяем есть ли дубликаты
	СтрокиДубликатов = ТаблицаРезультатов.НайтиСтроки(Новый Структура("ЕстьДубликат", Истина));
	Если СтрокиДубликатов.Количество() > 0 Тогда
		Результат.ЕстьДубликаты = Истина;
		Результат.СообщениеОДубликатах = НСтр("ru = 'Обнаружены существующие записи с такими параметрами.
			|Создание дублирующих записей невозможно.'");
		Возврат Результат;
	КонецЕсли;

	НазначениеИспользования = Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит;
	ТипПробы = Перечисления.гкс_ТипыПроб.Единичная;

    ДополнительныеДанныеЗаполнения = Новый Структура;
	ДополнительныеДанныеЗаполнения.Вставить("НазначениеИспользования", НазначениеИспользования);
	ДополнительныеДанныеЗаполнения.Вставить("ТипПробы", ТипПробы);
	ДополнительныеДанныеЗаполнения.Вставить("ТочкаМаршрута", Объект.ТочкаМаршрута);

	НачатьТранзакцию();
	Попытка
		Для Каждого СтрокаДанных Из ТаблицаРезультатов Цикл
			РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации.ЗаписатьПоказательУКПоРегистрации(
				СтрокаДанных, ДополнительныеДанныеЗаполнения, Сутки);
			Результат.СозданоЗаписей = Результат.СозданоЗаписей + 1;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при создании записей анализов: %1.'"), ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ВызватьИсключение;
	КонецПопытки;

	Возврат Результат;

КонецФункции

&НаСервере
Функция ТекстЗапросаПолучениеСоставаГруппПроверкаДубликатов()
	Возврат
	"ВЫБРАТЬ
	|	Входные.ГруппаТС КАК ГруппаТС,
	|	Входные.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_ВходныеДанные
	|ИЗ
	|	&ТаблицаВходныхДанных КАК Входные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Входные.ГруппаТС КАК ГруппаТС,
	|	Входные.Показатель КАК Показатель,
	|	ИсходныеЗаписи.ЗначениеПоказателяМин КАК ЗначениеПоказателяМин,
	|	ИсходныеЗаписи.ЗначениеПоказателяМакс КАК ЗначениеПоказателяМакс,
	|	ИсходныеЗаписи.Базис КАК Базис,
	|	ИсходныеЗаписи.ДокументРегистрации КАК ДокументРегистрации
	|ПОМЕСТИТЬ ВТ_ПоказателиУсиленногоКонтроляГруппы
	|ИЗ
	|	ВТ_ВходныеДанные КАК Входные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоставГруппТранспорта КАК СоставГруппы
	|		ПО Входные.ГруппаТС = СоставГруппы.ГруппаТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ИсходныеЗаписи
	|		ПО СоставГруппы.РегистрацияТранспорта = ИсходныеЗаписи.ДокументРегистрации
	|		И Входные.Показатель = ИсходныеЗаписи.Показатель
	|		И ИсходныеЗаписи.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Композитная)
	|		И
	|			ИсходныеЗаписи.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|ГДЕ
	|	ИсходныеЗаписи.СостояниеКачества <> ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияКачества.ПробыНеТребуются)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказателиУсиленногоКонтроляГруппы.ГруппаТС КАК ГруппаТС,
	|	ВТ_ПоказателиУсиленногоКонтроляГруппы.Показатель КАК Показатель,
	|	МАКСИМУМ(ВТ_ПоказателиУсиленногоКонтроляГруппы.ЗначениеПоказателяМин) КАК ЗначениеПоказателяМин,
	|	МАКСИМУМ(ВТ_ПоказателиУсиленногоКонтроляГруппы.ЗначениеПоказателяМакс) КАК ЗначениеПоказателяМакс,
	|	МАКСИМУМ(ВТ_ПоказателиУсиленногоКонтроляГруппы.Базис) КАК Базис
	|ПОМЕСТИТЬ ВТ_ИсходныеДанныеГруппы
	|ИЗ
	|	ВТ_ПоказателиУсиленногоКонтроляГруппы КАК ВТ_ПоказателиУсиленногоКонтроляГруппы
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоказателиУсиленногоКонтроляГруппы.ГруппаТС,
	|	ВТ_ПоказателиУсиленногоКонтроляГруппы.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состав.РегистрацияТранспорта КАК ДокументРегистрации,
	|	Входные.Показатель КАК Показатель,
	|	ЕСТЬNULL(ИсходныеДанные.ЗначениеПоказателяМин, 0) КАК ЗначениеПоказателяМин,
	|	ЕСТЬNULL(ИсходныеДанные.ЗначениеПоказателяМакс, 0) КАК ЗначениеПоказателяМакс,
	|	ЕСТЬNULL(ИсходныеДанные.Базис, 0) КАК Базис,
	|	ВЫБОР
	|		КОГДА Регистр.ДокументРегистрации ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьДубликат
	|ИЗ
	|	ВТ_ВходныеДанные КАК Входные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоставГруппТранспорта КАК Состав
	|		ПО Входные.ГруппаТС = Состав.ГруппаТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсходныеДанныеГруппы КАК ИсходныеДанные
	|		ПО Входные.ГруппаТС = ИсходныеДанные.ГруппаТС
	|		И Входные.Показатель = ИсходныеДанные.Показатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК Регистр
	|		ПО Состав.РегистрацияТранспорта = Регистр.ДокументРегистрации
	|		И Входные.Показатель = Регистр.Показатель
	|		И Регистр.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|		И Регистр.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоказателиУсиленногоКонтроляГруппы КАК ПоказателиУсиленногоКонтроляГруппы
	|		ПО Состав.РегистрацияТранспорта = ПоказателиУсиленногоКонтроляГруппы.ДокументРегистрации";

КонецФункции

&НаСервереБезКонтекста
Функция НеВсеПромежуточныеКомпозитыЗаДатуСформированы(ПроизводственныеСутки)

	РегистрацииБезКомпозита = гкс_ВходнойКонтрольКачества.
		РегистрацииБезПромежуточногоКомпозитаЗаДату(ПроизводственныеСутки);

	Возврат ЗначениеЗаполнено(РегистрацииБезКомпозита);

КонецФункции

// Проверяет наличие существующих единичных проб для регистраций
// с назначением использования ПромежуточныйКомпозит.
// Используется для исключения дублей при формировании проб с закладки "УК для ТС".
//
// Параметры:
//  МассивРегистраций - Массив - массив ссылок на документы регистрации
//
// Возвращаемое значение:
//  Булево - Истина, если хотя бы для одной регистрации уже существует единичная проба
//
&НаСервереБезКонтекста
Функция ЕстьДубликатыЕдиничныхПроб(МассивРегистраций)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФНПСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФНПСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФНП
	|		ПО ФНПСписокРегистраций.Ссылка = ФНП.Ссылка
	|		И ФНП.Проведен
	|		И ФНП.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СопоставлениеФНПЛабАнализа КАК СопоставлениеФНПЛА
	|		ПО ФНП.Ссылка = СопоставлениеФНПЛА.ФормированиеНомераПробы
	|		И
	|			СопоставлениеФНПЛА.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|ГДЕ
	|	ФНПСписокРегистраций.ДокументРегистрации В (&МассивРегистраций)";

	Запрос.УстановитьПараметр("МассивРегистраций", МассивРегистраций);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

#КонецОбласти
